#имя файла: Task 31.py
#номер версии: 1.0
#автор и его учебная группа: Александровский А.П., ЭУ-142
#дата создания: 22.05.2019
#связанные файлы: пакет numpy
#версия Python: 3.6
#ОПИСАНИЕ:  Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
            #случайными элементами. Добавить к элементам каждой строки такой новый
            #элемент, чтобы сумма положительных элементов стала бы равна модулю
            #суммы отрицательных элементов. Результат оформить в виде матрицы из N
            #строк и M + 1 столбцов.


# Подключение библиотеки Numpy и Random
import numpy as np
import random

# Число строк и столбцов, число Н
N = random.randint(2, 10)
M = random.randint(2, 10)

# Так как матрица должна быть прямоугольной, то N не может быть равно M
while N == M:
    N = random.randint(2, 10)
    M = random.randint(2, 10)

# Создание матрицы
A = np.random.randint(-10, 10, (N, M))
print(str(A) + "\n")

# Определение cуммы положительных и отрицательных элементов
X = []
for i in range(0, M):
    n = 0
    m = 0
    k = n - m
    for j in range(0, N):

        if A[j,i] < 0:
            n -= A[j,i]
        elif A[j,i] >= 0:
            m += A[j,i]
    print("Сумма положительных элементов " + str(i+1) + " столбца = " + str(m))
    print("Модуль суммы отрицательных элементов " + str(i+1) + " столбца = " + str(n))

    X.append(n-m)
X = np.array(X)
A = np.vstack((A, X))

print("\nНовая матрица: \n" + str(A))