#имя файла: Task 12.py
#номер версии: 1.0
#автор и его учебная группа: Александровский А.П., ЭУ-142
#дата создания: 22.05.2019
#связанные файлы: пакет numpy
#версия Python: 3.6
#ОПИСАНИЕ:  Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
            #случайными элементами. Разделить элементы каждой строки на элемент
            #этой строки с наибольшим значением.




# Подключение библиотеки Numpy и Random
import numpy as np
import random

# Число строк и столбцов
N = random.randint(2, 10)
M = random.randint(1, 10)

# Так как матрица должна быть прямоугольной, то N не может быть равно M
while N == M:
    N = random.randint(1, 10)
    M = random.randint(1, 10)

# Создание матрицы
A = np.random.randint(0, 10, (N, M)).astype(np.float64)
print(str(A) + "\n")

# Нахождение наибольшее значение для каждой строки матрицы
Max = A.max(axis=1)
Max = np.array(Max)[: , np.newaxis]

# Деление элеменотов
A = A / Max
print("\nНовая матрица: \n" + str(A))