#имя файла: Task 30.py
#номер версии: 1.0
#автор и его учебная группа: Александровский А.П., ЭУ-142
#дата создания: 22.05.2019
#связанные файлы: пакет numpy
#версия Python: 3.6
#ОПИСАНИЕ:  Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
            #случайными элементами. Добавить к элементам каждого столбца такой
            #новый элемент, чтобы сумма положительных элементов стала бы равна
            #модулю суммы отрицательных элементов. Результат оформить в виде
            #матрицы из N + 1 строк и M столбцов.


# Подключение библиотеки Numpy и Random
import numpy as np
import random

# Число строк и столбцов, число Н
N = random.randint(2, 10)
M = random.randint(2, 10)

# Так как матрица должна быть прямоугольной, то N не может быть равно M
while N == M:
    N = random.randint(2, 10)
    M = random.randint(2, 10)

# Создание матрицы
A = np.random.randint(-10, 10, (N, M))
print(str(A) + "\n")

# Определение cуммы положительных и отрицательных элементов
X = []
for i in range(0, N):
    n = 0
    m = 0
    k = n - m
    for j in range(0, M):

        if A[i,j] < 0:
            n -= A[i,j]
        elif A[i,j] >= 0:
            m += A[i, j]
    print("Сумма положительных элементов " + str(i+1) + " строки = " + str(m))
    print("Модуль суммы отрицательных элементов " + str(i+1) + " строки = " + str(n))

    X.append(n-m)
X = np.array(X)[: , np.newaxis]
A = np.hstack((A, X))

print("\nНовая матрица: \n" + str(A))