#имя файла: Task 1.py
#номер версии: 1.0
#автор и его учебная группа: Александровский А.П., ЭУ-142
#дата создания: 22.05.2019
#связанные файлы: пакет numpy
#версия Python: 3.6
#ОПИСАНИЕ:  Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
#           случайными элементами. Найти наибольший элемент столбца матрицы A,
#           для которого сумма абсолютных значений элементов максимальна.



# Подключение библиотеки Numpy и Random
import numpy as np
import random

# Число строк и столбцов
N = random.randint(2, 10)
M = random.randint(1, 10)

# Так как матрица должна быть прямоугольной, то N не может быть равно M
while N == M:
    N = random.randint(1, 10)
    M = random.randint(1, 10)

# Создание матрицы
A = np.random.randint(0, 10, (N, M))
print(str(A) + "\n")

# Нахождение суммы для каждого столбца матрицы
sum = A.sum(axis=0)

# Определение номера столбца, для которого,
# сумма абсолютных значений элементов максимальна
index = sum.argmax(axis=0)

# Нахождение наибольшего элемента в каждом столбце матрицы
max = A.max(axis=0)

# Нахождение наибольшего элемента столбца матрицы,
# для которого сумма абсолютных значений элементов максимальна
max = max[index]
print("Максимальный элемент: " + str(max))