#имя файла: Task 15.py
#номер версии: 1.0
#автор и его учебная группа: Александровский А.П., ЭУ-142
#дата создания: 22.05.2019
#связанные файлы: пакет numpy
#версия Python: 3.6
#ОПИСАНИЕ:  Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
            #случайными элементами. Все элементы имеют целый тип. Дано целое число
            #H. Определить, какие столбцы имеют хотя бы одно такое число, а какие не
            #имеют.




# Подключение библиотеки Numpy и Random
import numpy as np
import random

# Число строк и столбцов, число Н
N = random.randint(2, 10)
M = random.randint(1, 10)
H = random.randint(1, 10)

# Так как матрица должна быть прямоугольной, то N не может быть равно M
while N == M:
    N = random.randint(1, 10)
    M = random.randint(1, 10)

# Создание матрицы
A = np.random.randint(0, 10, (N, M))
print(str(A) + "\n")

# Определение количества Н элементов в столбце
print("Н элемент = " + str(H))

for i in range(0, M):
    n = 0
    for j in range(0, N):
        if A[j,i] == H:
            n += 1
    if n > 0:
        print("В столбце " + str(i+1) + " - " + str(n) + " Н элементов")
    elif n == 0:
        print("В столбце " + str(i + 1) + " - нет Н элементов")
