#имя файла: Task 22.py
#номер версии: 1.0
#автор и его учебная группа: Александровский А.П., ЭУ-142
#дата создания: 22.05.2019
#связанные файлы: пакет numpy
#версия Python: 3.6
#ОПИСАНИЕ:  Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
            #случайными элементами. Исходная матрица состоит из нулей и единиц.
            #Добавить к матрице еще один столбец, каждый элемент которого делает
            #количество единиц в каждой строке чётным.




# Подключение библиотеки Numpy и Random
import numpy as np
import random

# Число строк и столбцов
N = random.randint(2, 10)
M = random.randint(1, 10)

# Так как матрица должна быть прямоугольной, то N не может быть равно M
while N == M:
    N = random.randint(1, 10)
    M = random.randint(1, 10)

# Создание матрицы
A = np.random.randint(0, 2, (N, M))
print(str(A) + "\n")

# Подсчет едениц в каждой строке
X = []
for i in range(0, N):
    n = 0
    for j in range(0, M):
        if A[i,j] == 1:
            n += 1
    if n%2 != 0:
        X.append(1)
    elif n%2 == 0:
        X.append(0)

# Добавление столбца
X = np.array(X)[: , np.newaxis]
A = np.hstack((A, X))
print(A)