#имя файла: Task 28.py
#номер версии: 1.0
#автор и его учебная группа: Александровский А.П., ЭУ-142
#дата создания: 22.05.2019
#связанные файлы: пакет numpy
#версия Python: 3.6
#ОПИСАНИЕ:  Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
            #случайными элементами. Исключить из матрицы столбец с номером K.
            #Сомкнуть столбцы матрицы.




# Подключение библиотеки Numpy и Random
import numpy as np
import random

# Число строк и столбцов, число K
N = random.randint(2, 10)
M = random.randint(1, 10)
K = random.randint(1, M)

# Так как матрица должна быть прямоугольной, то N не может быть равно M
while N == M:
    N = random.randint(1, 10)
    M = random.randint(1, 10)

# Создание матрицы
A = np.random.randint(0, 10, (N, M))
print(str(A) + "\n")

# Удаление столбца K
print("K = " + str(K))

A = np.delete(A, (K-1), axis=1)

print("\nНовая матрица: \n" + str(A))