#имя файла: Task 9.py
#номер версии: 1.0
#автор и его учебная группа: Александровский А.П., ЭУ-142
#дата создания: 22.05.2019
#связанные файлы: пакет numpy
#версия Python: 3.6
#ОПИСАНИЕ:  Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
            #случайными элементами. Определить, сколько нулевых элементов
            #содержится в верхних L строках матрицы и в левых К столбцах матрицы.




# Подключение библиотеки Numpy и Random
import numpy as np
import random

# Число строк и столбцов
N = random.randint(2, 10)
M = random.randint(1, 10)

#Верхние L строки и левые К столбцы матрицы
L = random.randint(1, N)
K = random.randint(1, M)

print("L = " + str(L) + "\nK = " + str(K) + "\n")
# Так как матрица должна быть прямоугольной, то N не может быть равно M
while N == M:
    N = random.randint(1, 10)
    M = random.randint(1, 10)

# Создание матрицы
A = np.random.randint(0, 10, (N, M))
print(str(A) + "\n")

# Определение нулевых элементов в верхних L строках
n = 0
for i in range(0, L):
    for j in range(0, M):
        if A[i,j] == 0:
            n += 1
print("Количество нулевых элементов в верхних L строках: " + str(n))

# Определение нулевых элементов в левых K солбцах
m = 0
for i in range(0, K):
    for j in range(0, N):
        if A[j,i] == 0:
            m += 1
print("Количество нулевых элементов в левых K солбцах: " + str(m))

