#имя файла: Task 25.py
#номер версии: 1.0
#автор и его учебная группа: Александровский А.П., ЭУ-142
#дата создания: 22.05.2019
#связанные файлы: пакет numpy
#версия Python: 3.6
#ОПИСАНИЕ:  Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
            #случайными элементами. Определить, сколько нулевых элементов
            #содержится в каждом столбце и в каждой строке матрицы. Результат
            #оформить в виде матрицы из N + 1 строк и M + 1 столбцов.




# Подключение библиотеки Numpy и Random
import numpy as np
import random

# Число строк и столбцов
N = random.randint(2, 10)
M = random.randint(1, 10)

# Так как матрица должна быть прямоугольной, то N не может быть равно M
while N == M:
    N = random.randint(1, 10)
    M = random.randint(1, 10)

# Создание матрицы
A = np.random.randint(-1, 3, (N, M))
print(str(A) + "\n")

# Определение количества нулевых элементов в строке
X = []
for i in range(0, N):
    K = 0
    for j in range(0, M):
        if A[i,j] == 0:
            K += 1
    X.append(K)

# Определение количества нулевых элементов в столбце
Y = []
for i in range(0, M):
    K = 0
    for j in range(0, N):
        if A[j,i] == 0:
            K += 1
    Y.append(K)

# Добавление столбца и строки к матрице A
X = np.array(X)[: , np.newaxis]
A = np.hstack((A, X))

Y = np.hstack((Y, [0.]))
A = np.vstack((A, Y))

print("\nНовая матрица: \n" + str(A))