#имя файла: Task 21.py
#номер версии: 1.0
#автор и его учебная группа: Александровский А.П., ЭУ-142
#дата создания: 22.05.2019
#связанные файлы: пакет numpy
#версия Python: 3.6
#ОПИСАНИЕ:  Создать квадратную матрицу A, имеющую N строк и N столбцов со
            #случайными элементами. Каждой паре элементов, симметричных
            #относительно главной диагонали (ближайшие к главной), присвоить
            #значения, равные полусумме этих симметричных значений (элементы
            #главной диагонали имеют индексы от [0,0] до [N,N]).




# Подключение библиотеки Numpy и Random
import numpy as np
import random

# Число строк и столбцов
N = random.randint(2, 10)

# Создание матрицы
A = np.random.randint(1, 10, (N, N))
print(str(A) + "\n")

# Создание симметричной матрицы
B = (A + A.T)/2
print("Новая матрица: \n" + str(B))
