#имя файла: Task 10.py
#номер версии: 1.0
#автор и его учебная группа: Александровский А.П., ЭУ-142
#дата создания: 22.05.2019
#связанные файлы: пакет numpy
#версия Python: 3.6
#ОПИСАНИЕ:  Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
            #случайными элементами. Перемножить элементы каждого столбца матрицы
            #с соответствующими элементами K-го столбца




# Подключение библиотеки Numpy и Random
import numpy as np
import random

# Число строк и столбцов
N = random.randint(2, 10)
M = random.randint(2, 10)

# К-ый столбец матрицы
K = random.randint(1, M)

# Так как матрица должна быть прямоугольной, то N не может быть равно M
while N == M:
    N = random.randint(2, 10)
    M = random.randint(2, 10)

# Создание матрицы
A = np.random.randint(0, 10, (N, M))
print(str(A) + "\n")

# Определение K-ого столбца
K_arr = np.array(A[:, K-1])
K_arr = K_arr[: , np.newaxis]
print("K-ый столбец: \n" + str(K_arr))

# Перемножение элементов
A = A * K_arr

print("\nНовая матрица: \n" + str(A))